#+TITLE: Documentation
#+AUTHOR: Petros Papapanagiotou
#+EMAIL: petros@workflowfm.com
#+OPTIONS: toc:nil email:t
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :results output drawer :session proter :exports both :eval no-export :dir ../../
#+HUGO_AUTO_SET_LASTMOD: t

#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: docs
#+HUGO_PAIRED_SHORTCODES: tip

*** Constant
    A [[../../../api/com/workflowfm/proter/Constant.html][~Constant~]]/[[../../../api/com/workflowfm/proter/ConstantLong.html][~ConstantLong~]] distribution always produces the same value, and its estimate is the value itself. 
  
    #+BEGIN_SRC scala
      {
        val constant = Constant(6)
        println(s"Value: ${constant.get[IO].unsafeRunSync()} - Estimate: ${constant.estimate}")
      }
    #+END_SRC    

    #+RESULTS:
    : Value: 6.0 - Estimate: 6

*** Uniform
    A [[../../../api/com/workflowfm/proter/Uniform.html][~Uniform~]]/[[../../../api/com/workflowfm/proter/UniformLong.html][~UniformLong~]] distribution produces a value uniformly between a minimum (inclusive) and a maximum (exclusive).
  
    #+BEGIN_SRC scala
      {
        val uniform = Uniform(5, 10)
        println(s"Value: ${uniform.get[IO].unsafeRunSync()} - Estimate: ${uniform.estimate}")
      }
    #+END_SRC    

    #+RESULTS:
    : Value: 6.271855193121533 - Estimate: 7.5

*** Exponential
    An [[../../../api/com/workflowfm/proter/Exponential.html][~Exponential~]] distribution produces a positive value with an [[https://en.wikipedia.org/wiki/Exponential_distribution][exponential distribution]], i.e. continuous, independent values with a constant average rate, corresponding to a [[https://en.wikipedia.org/wiki/Poisson_point_process][Poisson point process]].

    This distribution is very commonly used in business process simulation thanks to its constant average rate, which tends to fit well with various types of processes (such as the arrival patterns of customers in a shop).
  
    #+BEGIN_SRC scala
      {
        val exp = Exponential(10)
        println(s"Value: ${exp.get[IO].unsafeRunSync()} - Estimate: ${exp.estimate}")
      }
    #+END_SRC    

    #+RESULTS:
    : Value: 11.758318395019977 - Estimate: 10.0


*** Task

    A [[../../../api/com/workflowfm/proter/Task.html][~Task~]] in Proter represents a basic unit of work or activity in a process. It is characterised by 2 key properties:

    1. A /name/ describing the task. It does not necessarily need to be unique, but it is often helpful to distinguish the task from others.
    2. A /duration/ in the form of a [[#distributions][~LongDistribution~]]. There exist constructors that accept a constant ~Long~ duration (which is then automatically converted to a ~ConstantLong~ distribution).

    Additional properties can be specified optionally:
    1. A /one-off cost/ incurred when the task is executed, in the form of a [[#distributions][~Distribution~]].
    2. A /map of resources and corresponding required capacities/. This describes which [[#resources][resources]] are required for the task to be executed, and how much of each resource.
    3. A /priority/ in the form of an integer value. This is taken into consideration when scheduling tasks that require the same resource(s).
    4. A /minimum starting timestamp/, which can be used to schedule tasks that have to start in some time in the future.

    Declarative convenience functions allow us to put these priorities together in successive calls. For example, we can construct a task as follows:

     #+BEGIN_SRC scala
       {
         val task = Task("Example Task", 5L)
           .withCost(Uniform(5,10))
           .withPriority(Task.High)
           .withResources(Seq("A", "B"))
           .withResourceQuantities(Map() + ("C" -> 2))
       }
     #+END_SRC    

     #+RESULTS:
     : val task: com.workflowfm.proter.Task = Task(Example Task,None,ConstantLong(5),Uniform(5.0,10.0),0,Map(A -> 1, B -> 1, C -> 2),-1,1,-1)

     This task is named "Example Task", will last 5 units of time, will cost between 5 and 10 units of cost, will have High priority (1), and will require 1 unit of capacity from resources "A" and "B", and 2 units of capacity from resource "C".

     You may also note that tasks have an optional unique ID (UUID). In the vast majority of cases this is not required and should be left as ~None~. In fact in some cases providing an ID can lead to undesired effects. Essentially, the ID will be passed on to any task instances generated for this task. This can help us keep track of the instances generated and link them back to the original task, for instance when testing the simulator. 

*** Task instance

    A ~Task~ is used to specify all the properties of a unit of work. Based on this specification, we construct instances of actual simulated work in the form of a [[../../../api/com/workflowfm/proter/TaskInstance.html][~TaskInstance~]]. 

    A task instance has a specific unique ID (UUID), obtains specific, sampled values of duration and cost, is attached to a specific [[#cases][case]] to which it belongs, and has a ~created~ property containing the timestamp of its creation. The latter can be used to measure the delay between its creation and the start of its execution (typically due to busy resources).

    Task instances are constructed internally by the simulator and appear in the [[#results][resulting events and metrics]].

     #+BEGIN_SRC scala
       {
         val taskInstance = task.create[IO]("Some case", 20).unsafeRunSync()
       }
     #+END_SRC    

     #+RESULTS:
     : val taskInstance: com.workflowfm.proter.TaskInstance = Task(4acfdbf8-f87e-4b11-92ec-2ef23696a78c,Example Task,Some case,20,[A -> 1,B -> 1,C -> 2],d5(5),c9.822675358051587,i-1,1)

